{
  "name": "OpenAlex: Get list of authors",
  "category": "Bibliometrics",
  "description": "This preset accompanies the third tutorial of our [Getting Started with OpenAlex](https://github.com/strohne/Facepager/wiki/Getting-Started-with-OpenAlex) guide. \n\nThe preset fetches a list of authors filtered by the name of their last known institution.  While the query is thus based on an OpenAlexID referencing an institution and you can insert one as usual, via *Add Nodes* in the Menu bar (e.g., I22465464), you do have the chance to repurpose the \"OpenAlex: Get author\" preset by leveraging Facepagers *Response* feature as well. To do so, first apply the “OpenAlex: Get author” preset. In the Query Setup set last_known_institution as *Key to extract* and id *Key for Object ID*. Hit *Fetch Data* once more. Note that your query returns a new node containing an OpenAlexID referencing the last known institution of your stated author. Now, apply the \"OpenAlex: Get list of authors\" preset again, select the newly created seed node and retrieve all authors affiliated with the institution.   \n\n(For Windows users only) Alternatively use the user-friendly *Transfer nodes* feature. First apply the “OpenAlex: Get author” preset and fetch data. Next, select *Transfer nodes* and set last_known_institution.id as *Extraction key*. By applying this feature Facepager will automatically generate a new seed node containing an OpenAlexID referencing the last known institution of your stated author. Apply the \"OpenAlex: Get list of authors\" preset again, select the newly created seed node and fetch all authors affiliated with the institution.\n\nIn this preset the authors list is sorted by their citation count. Of course that is only one way to arrange the results. Refer to [OpenAlex' documentation](https://docs.openalex.org/how-to-use-the-api/get-lists-of-entities/sort-entity-lists) to learn more.\n\nAdditionally, specify the *select* parameter to narrow down your query. The preset at hand asks for id, orcid, display_name, works_count, and cited_by_count of all authors associated with the stated institution. Check out [OpenAlex's documentation on author-objects](https://docs.openalex.org/api-entities/authors/author-object) to get an overview over all options.\n\nPlease note that each user is allowed a maximum of 100,000 API calls per day and 10 API calls per second. If you need a higher limit, you can register for OpenAlex Premium. ",
  "module": "Generic",
  "options": {
    "auth": "disable",
    "auth_prefix": "",
    "auth_tokenname": "",
    "auth_type": "Disable",
    "auth_uri": "",
    "basepath": "https://api.openalex.org",
    "extension": "",
    "fileext": "<None>",
    "filename": "<None>",
    "format": "json",
    "headers": {},
    "key_paging": null,
    "nodedata": "results",
    "objectid": null,
    "pages": 1,
    "paging_stop": null,
    "paging_type": "key",
    "param_paging": null,
    "params": {
      "filter": "last_known_institution.id:<Object ID>",
      "per-page": "50",
      "select": "id, orcid, display_name, works_count,\ncited_by_count",
      "sort": "cited_by_count:desc"
    },
    "proxy": "",
    "redirect_uri": "",
    "resource": "/authors",
    "scope": "",
    "token_uri": "",
    "verb": "GET"
  },
  "speed": 200,
  "saveheaders": false,
  "timeout": 15,
  "maxsize": 5,
  "columns": [
    "id",
    "orcid",
    "display_name",
    "works_count",
    "cited_by_count"
  ]
}